<?php
declare(strict_types=1);

return [
    [
        "id" => 1,
        "name" => "Война и мир",
        "category" => "Классика",
        "price" => 5500.0,
        "stock" => 10,
        "created_at" => "2026-01-10",
        "author" => "Лев Толстой",
        "genre" => "Роман"
    ],
    [
        "id" => 2,
        "name" => "Преступление и наказание",
        "category" => "Классика",
        "price" => 4200.0,
        "stock" => 5,
        "created_at" => "2026-01-15",
        "author" => "Фёдор Достоевский",
        "genre" => "Роман"
    ],
    [
        "id" => 3,
        "name" => "Мастер и Маргарита",
        "category" => "Классика",
        "price" => 4800.0,
        "stock" => 8,
        "created_at" => "2026-02-01",
        "author" => "Михаил Булгаков",
        "genre" => "Мистика"
    ],
    [
        "id" => 4,
        "name" => "Чистый код",
        "category" => "Программирование",
        "price" => 12500.0,
        "stock" => 3,
        "created_at" => "2026-02-10",
        "author" => "Роберт Мартин",
        "genre" => "Техническая литература"
    ],
    [
        "id" => 5,
        "name" => "Грокаем алгоритмы",
        "category" => "Программирование",
        "price" => 9900.0,
        "stock" => 12,
        "created_at" => "2026-02-20",
        "author" => "Адитья Бхаргава",
        "genre" => "Техническая литература"
    ],
    [
        "id" => 6,
        "name" => "1984",
        "category" => "Фантастика",
        "price" => 3900.0,
        "stock" => 15,
        "created_at" => "2026-03-01",
        "author" => "Джордж Оруэлл",
        "genre" => "Антиутопия"
    ],
    [
        "id" => 7,
        "name" => "Вино из одуванчиков",
        "category" => "Фантастика",
        "price" => 4100.0,
        "stock" => 0,
        "created_at" => "2026-03-05",
        "author" => "Рэй Брэдбери",
        "genre" => "Фантастика"
    ],
    [
        "id" => 8,
        "name" => "Алиса в Стране чудес",
        "category" => "Детская литература",
        "price" => 3100.0,
        "stock" => 7,
        "created_at" => "2026-03-10",
        "author" => "Льюис Кэрролл",
        "genre" => "Сказка"
    ],
];